CSI API ETABS v1

# cSapModelLinkElm Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cLinkElm LinkElm { get; }

    ReadOnly Property LinkElm As cLinkElm
    	Get

    Dim instance As cSapModel
    Dim value As cLinkElm

    value = instance.LinkElm

    property cLinkElm^ LinkElm {
    	cLinkElm^ get ();
    }

    abstract LinkElm : cLinkElm with get

#### Property Value

Type: cLinkElm

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com